---
hide:
  - navigation
---

## 为什么是游戏开发

在这篇blog将分享我的25fall 游戏设计项目的申请，我的主要申请方向是**游戏开发**。在我的申请过程中，opencs.app这个平台给了我许多帮助，但是我发现站内大多数的文章和评论都是关于更加严格意义上的cs项目，例如AI，算法，而与游戏开发美硕的相关内容比较少，但是我又发现想要去美国做游戏的同学却不在少数，在我完成申请后，找我咨询的学弟学妹真挺不少，于是萌生了写一个blog分享一下我在这个申请过程中的各种磕磕绊绊。

首先，在我看来很多人可能会混淆游戏设计与游戏开发，需要明确的是，**游戏设计**侧重于游戏的规则、玩法及用户体验构思，更偏向创意和艺术；而**游戏开发**则是通过编程和技术将这些设计转化为实际可玩的游戏，它本质上属于计算机科学（CS）领域。我的申请项目正是游戏开发方向的硕士课程，这明确是CS的一个分支。考虑到opencs.app是一个专注于CS美硕申请的分享平台，在这里分享我的游戏开发申请经历，正是基于它作为CS专业一部分的定位，我相信这些经验对关注相关领域的申请者会非常有帮助。

## 我的背景

我的背景其实有点特殊性，首先我本科一个中外合办高校cs。但是申请美硕，中外合办并没有明显优势，按照我和同校同学的经验，我们大概是被当作普通211的学生去看的。其次我并不是个好学生，我的三维并不高，绩点只有3.65，托福99，GRE315（没有提交）。我大多数时间都花在了做各种项目上，一是HCI实验室里担任了三年的RA，做了几个XR严肃游戏，4篇二三作论文发表，2篇在投；二是有两段实习，在初创做过全栈，在外企做过前端。这些项目虽说都不是特别硬核的，但也确实够我填满两面的CV了。

于是我的的申请思路就是，重点突出我的项目经验，突出我的团队合作能力和跨学科能力，弱化我成绩上的劣势。当然这个策略有利有弊。

## 选校List

我会推荐鸡蛋不要放在一个篮子里，因此除了这些游戏开发的项目，我还申请了不少其他cs的项目，但是为了不偏离这个Blog主题，我这里只讨论游戏开发的选校。

| USC 南加大     | MS Game Development                                         | https://www.cs.usc.edu/academic-programs/masters/game-development/ | 录取        | 南加大游戏相关的项目十分丰富，总共多达六个，因此仔细甄别这些项目的特点，找到那个适合你的就十分重要。这个项目是开设在cs学院下的，更加的注重编程，而且可以选到一些传统cs课，可以有机会沉淀代码能力。实习就业机会拉满，毕竟在洛圣都。 |
| -------------- | ----------------------------------------------------------- | ------------------------------------------------------------ | ----------- | ------------------------------------------------------------ |
| Duke 杜克      | Game Design, Development & Innovation Master of Engineering | https://masters.pratt.duke.edu/gddi/                         | 录取        | Duke新开的游戏项目，放在工学院下，但是技术涉及的不是很深，例如必修的游戏编程这么课涉及面实在太广，有点走马观花。更像是经历一下整个游戏工业的流程。由于Epic 在Duke边上，因此有丰富的实习机会，据说这个项目会直接送游戏大厂的实习，但目前这个就业状况，这个饼实现起来并不容易。 |
| Upenn 宾大     | MSE in Computer Graphics and Game Technology                | https://www.cis.upenn.edu/graduate/program-offerings/mse-in-computer-graphics-and-game-technology/ | 拒绝        | 很老牌的游戏技术项目，但与其说是游戏项目，不如说是个图形学项目。课程很硬，workload极大，官网上说是一年项目，但是几乎没人能在一年内上满这八门课。即使是小白，在这个项目熬出完，也能成为一个合格的图程。 |
| CMU 卡耐基梅隆 | ETC Master of Entertainment Technology                      | https://www.etc.cmu.edu/learn/curriculum/                    | 录取接offer | 不是工学位也不是理学位，而是全球独一份的master of entertainment technology，很神奇吧。游戏御三家之一，成员组成很多元，有搞技术的也有做美术做策划的。很特殊的是，这个项目不是course-based而是project-based，每个学期一个项目。出来以后你的作品集会很好看。很和我胃口，也是我最后去的项目。再者做项目的同时，可选三门课，我准备全选cmu cs院的，沉淀一下技术。据说这个项目从学生到老师都很会玩，很多样性。 |
| Utah 犹他      | Master of Entertainment Arts and Engineering                | https://games.utah.edu/prospective-students/master-of-entertainment-arts-and-engineering/ | 录取        | 犹他大学的game是名声挺好的，但是听闻就读体验并不是很好。就是比较的boring，因为要阅读大量的游戏研究的论文，并写大量的report。至少作为一个游戏专业，play并不是很多，而是大量的学术。但是听闻游戏业界的前辈说，犹他的毕业生作品集都很扎实，完成度很高。 |

## 关于中介和作品集

中介和作品集是游戏申请中始终绕不开的一件事，因为几乎所有的游戏相关的硕士项目，都要求上交作品集。中介们当然不会浪费这个除了文书，又一个获利机会。刚开始申请的我，也很慌张，作为一个没有一点平面设计的天赋的家伙，我的首选也是找作品集中介。但是在高强度与各种中介对线后，确实感觉到了这个价格有点难以接受。这些作品集中介的服务一般分为两种，一种是作品集全包，从头带你做项目；一种是帮你把你已有的项目重新排版，做成作品集。作品集全包，一般包含老师带着做的四个项目，总费用在8w-10w左右，当然更过分的也有。我一开始刚咨询第一家中介，差点就下决心签全包作品集，幸好被一个做游戏的前辈给劝住了，才多了解了几家。但最后我并没有选择这种全包服务，因为货比三家后，发现这些中介话术其实有点类似了，多多少少带点pua，会说你之前的项目不行，需要提升，然后就会开始给你规划，但是多了解几家以后，你会发现，这些中介的作品集组成大差不差，很公式化，有关卡设计的作品，有偏esg公益性质的严肃有序。根据后面跟游戏前辈们聊天，我们申请偏cs方向的开发，其实并不需要多么fancy的作品集，实际上多参加几个game jam，就可以作为作品集了。因此我后面选择了第二个方式，就是让中介帮我将已有项目重新排版，一个项目3k，现在想来还是蛮贵的，或许自己多花点心思用ppt排版，也能达成类似的效果。

关于文书呢，那是完全不推荐全部交给中介。文书一定一定要自己把控，跟着项目官网一条一条看，每个项目最好都改一遍文书，没有哪个项目的要求是相同的，也不会有一个适合所有项目的文书。

## 最后

Anyway，兜兜转转最后也拿到心仪的offer。也希望大家在后面的申请中，保持信心，走出一个自己的路。



[回到列表 :fontawesome-solid-house:](blog.md){ .md-button }
